---
kind: property
id: P:Autodesk.Revit.DB.Revolution.Axis
zh: 轴、x轴、y轴、z轴
source: html/030482e1-5974-6cf0-56af-ff43b83c30fd.htm
---
# Autodesk.Revit.DB.Revolution.Axis Property

**中文**: 轴、x轴、y轴、z轴

Returns the Axis of the Revolution.

## Syntax (C#)
```csharp
public ModelLine Axis { get; }
```

## Remarks
This property is used to retrieve the Axis of the Revolution.